Revit 2026 API

# FilteredElementCollectorGetElementIterator Method

---

Returns an element iterator to the elements passing the filters.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilteredElementIterator GetElementIterator()
```
```vb
Public Function GetElementIterator As FilteredElementIterator
```
```cpp
public:
FilteredElementIterator^ GetElementIterator()
```
```fsharp
member GetElementIterator : unit -> FilteredElementIterator
```

#### Return Value

FilteredElementIterator

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The collector does not have a filter applied. Extraction or iteration of elements is not permitted without a filter. |

Calling this when you have an active iterator to this same collector will result in the first iterator being stopped by this call.

#### Reference

FilteredElementCollector Class

Autodesk.Revit.DB Namespace